'''
Напишете рекурсивна функция за двоично търсене в нареден списък.

not found - ако стойността не се намира в списъка
found at X - ако първото срещане на търсената стойност в списъка е на позиция X

Списъкът за търсене да е статично описан в кода и да е следният:
[30, 40, 50, 52, 56, 62, 70, 91, 100, 131, 132, 166, 170, 195, 202, 205, 212, 248, 249, 256, 263, 272, 288, 289, 290, 296, 332, 345, 352, 364, 380, 390, 407, 412, 429, 430, 438, 444, 486, 493, 497, 499, 510, 513, 514, 519, 521, 521, 535, 546, 552, 554, 556, 570, 584, 638, 640, 655, 655, 657, 692, 692, 711, 713, 731, 739, 740, 842, 858, 885, 887, 888, 893, 898, 900, 903, 908, 909, 959, 988]

Примерен изход при подаване на параметър 88999999
not found

Примерен изход при подаване на параметър 584
found at 54
'''
import sys


# def search(el, len_arr):
#     if not list:
#         return
#
#     mid_idx = len_arr // 2
#     mid_el = arr[mid_idx]
#
#     if mid_el < el:
#         return search(el, mid_idx+(mid_idx//2))
#     elif mid_el > el:
#         return search(el, mid_idx-(mid_idx//2))
#     elif mid_el == el:
#         return f"found at {mid_idx}"
#     else:
#         return f"not found"

# arr = [30, 40, 50, 52, 56, 62, 70, 91, 100, 131, 132, 166, 170, 195, 202, 205, 212, 248, 249, 256, 263, 272, 288,
#         289, 290, 296, 332, 345, 352, 364, 380, 390, 407, 412, 429, 430, 438, 444, 486, 493, 497, 499, 510, 513, 514,
#         519, 521, 521, 535, 546, 552, 554, 556, 570, 584, 638, 640, 655, 655, 657, 692, 692, 711, 713, 731, 739, 740,
#         842, 858, 885, 887, 888, 893, 898, 900, 903, 908, 909, 959, 988]

def binary_search(el, arr, left, right):
    if left > right:
        return "not found"

    mid_idx = (left + right) // 2
    mid_el = arr[mid_idx]

    if mid_el < el:
        return binary_search(el, arr, mid_idx + 1, right)
    elif mid_el > el:
        return binary_search(el, arr, left, mid_idx - 1)
    else:
        return f"found at {mid_idx}"

arr = [30, 40, 50, 52, 56, 62, 70, 91, 100, 131, 132, 166, 170, 195, 202, 205, 212, 248, 249, 256, 263, 272, 288, 289, 290, 296, 332, 345, 352, 364, 380, 390, 407, 412, 429, 430, 438, 444, 486, 493, 497, 499, 510, 513, 514, 519, 521, 521, 535, 546, 552, 554, 556, 570, 584, 638, 640, 655, 655, 657, 692, 692, 711, 713, 731, 739, 740, 842, 858, 885, 887, 888, 893, 898, 900, 903, 908, 909, 959, 988]


if __name__ == "__main__":
    if len(sys.argv) < 2:
        print("Expecting <element>")
        sys.exit(1)
    element = int(sys.argv[1])

    print(binary_search(element, arr, 0, len(arr) - 1))